{"class_name": "Model", "keras_version": "1.2.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "input_dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "activation": "linear", "input_dtype": "float32", "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "batch_input_shape": [null, 224, 224, 3], "border_mode": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_regularizer": null, "W_regularizer": null, "nb_row": 5, "activation": "linear", "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [5, 5], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "activation": "linear", "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 173056, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 256}}], "inbound_nodes": [[["input_1", 0, 0]], [["input_2", 0, 0]]], "name": "sequential_1"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0007\u0000\u0000\u0000C@\u0001\u0000sE\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000t\u0000\u0000j\u0001\u0000t\u0000\u0000j\u0002\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000|\u0002\u0000\u0018\u0083\u0001\u0000d\u0001\u0000d\u0002\u0000d\u0003\u0000t\u0004\u0000\u0083\u0001\u0002\u0083\u0001\u0000d\u0004\u0000\u0015}\u0003\u0000|\u0003\u0000S(\u0005\u0000\u0000\u0000Nt\u0004\u0000\u0000\u0000axisi\u0001\u0000\u0000\u0000t\b\u0000\u0000\u0000keepdimsi\u0000\u0001\u0000\u0000(\u0005\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0004\u0000\u0000\u0000sqrtt\u0003\u0000\u0000\u0000sumt\u0006\u0000\u0000\u0000squaret\u0004\u0000\u0000\u0000True(\u0004\u0000\u0000\u0000t\u0005\u0000\u0000\u0000vectst\u0001\u0000\u0000\u0000xt\u0001\u0000\u0000\u0000yt\u0005\u0000\u0000\u0000testK(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\f\u0000\u0000\u0000siameseQA.pyt\u0012\u0000\u0000\u0000euclidean_distance\u0015\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001\f\u00015\u0001", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": ["c\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0002\u0000\u0000\u0000C@\u0001\u0000s\u001a\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000|\u0001\u0000d\u0001\u0000\u0019d\u0002\u0000f\u0002\u0000S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0003\u0000\u0000\u0000t\u0006\u0000\u0000\u0000shapest\u0006\u0000\u0000\u0000shape1t\u0006\u0000\u0000\u0000shape2(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\f\u0000\u0000\u0000siameseQA.pyt\u0016\u0000\u0000\u0000eucl_dist_output_shape\u001a\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "output_shape_type": "lambda"}, "inbound_nodes": [[["sequential_1", 1, 0], ["sequential_1", 2, 0]]], "name": "lambda_1"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["lambda_1", 0, 0]], "name": "model_1"}}